erp3l/src/Documents/РеестрУступленныхДенежныхТребований/РеестрУступленныхДенежныхТребований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрУступленныхДенежныхТребований</name>
  <comment>(-УХ)</comment>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.ЭффективностьФакторинга</registerRecords>
  <registerRecords>InformationRegister.ВерсииРасчетов</registerRecords>
  <registerRecords>InformationRegister.УдалитьГрафикиРасчетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФинансирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдержаннаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАвансаПоФакторингу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавкаПоФакторингу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияЗаОбработкуСчетаФактуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбязательств</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УступленныеТребования</name>
    <attributes>
      <name>УдалитьДокументОснование</name>
      <type>
        <types>DocumentRef.ОтражениеФактическихДанныхБюджетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбязательства</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПогашения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПоФакторингу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.РасчетныйДокумент</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикРасчета</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/AccumulationRegisters/РасчетыСКонтрагентамиГрафики/РасчетыСКонтрагентамиГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиГрафики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОперация</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОперацииФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПлатежа</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <comment>Операция графика</comment>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПредметГрафика</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВерсияСоглашенияВалютныйСвоп</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ЦенныеБумаги</types>
      <types>DocumentRef.РеестрУступленныхДенежныхТребований</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/РеестрУступленныхДенежныхТребований/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаОбязательств = УступленныеТребования.Итог("СуммаОбязательства");
	СуммаПоступления = ГрафикРасчета.Итог("СуммаПоступления");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Ссылка.Организация КАК Организация,
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Ссылка.Контрагент КАК Контрагент,
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Контрагент КАК Дебитор,
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Ссылка.ДатаФинансирования КАК Период,
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Ссылка КАК Регистратор,
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.СуммаОбязательства КАК УступленнаяЗадолженность,
		|	0 КАК СуммаПоступления,
		|	0 КАК Комиссия,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) КАК СтатьяБюджета,
		|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг) КАК ЭлементСтруктурыЗадолженности
		|ПОМЕСТИТЬ Расчет
		|ИЗ
		|	Документ.РеестрУступленныхДенежныхТребований.УступленныеТребования КАК РеестрУступленныхДенежныхТребованийУступленныеТребования
		|ГДЕ
		|	РеестрУступленныхДенежныхТребованийУступленныеТребования.Ссылка = &Ссылка
		|	И НЕ РеестрУступленныхДенежныхТребованийУступленныеТребования.Отклонено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Ссылка.Организация,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Ссылка.Контрагент,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Контрагент,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Дата,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Ссылка,
		|	0,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.СуммаПоступления,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Комиссия,
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.СтатьяДвиженияДенежныхСредств,
		|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг)
		|ИЗ
		|	Документ.РеестрУступленныхДенежныхТребований.ГрафикРасчета КАК РеестрУступленныхДенежныхТребованийГрафикРасчета
		|ГДЕ
		|	РеестрУступленныхДенежныхТребованийГрафикРасчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расчет.Организация КАК Организация,
		|	Расчет.Контрагент КАК Контрагент,
		|	Расчет.Дебитор КАК Дебитор,
		|	Расчет.Период КАК Период,
		|	Расчет.Регистратор КАК Регистратор,
		|	СУММА(Расчет.УступленнаяЗадолженность) КАК УступленнаяЗадолженность,
		|	СУММА(Расчет.СуммаПоступления) КАК Получено,
		|	СУММА(Расчет.Комиссия) КАК Комиссия
		|ИЗ
		|	Расчет КАК Расчет
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.Дебитор,
		|	Расчет.Период,
		|	Расчет.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Ссылка КАК ПредметГрафика,
		|	&Ссылка КАК ВерсияГрафика,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	Расчет.Период КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) КАК СтатьяБюджета,
		|	СУММА(Расчет.УступленнаяЗадолженность) КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход,
		|	Расчет.Организация КАК Организация,
		|	Расчет.Контрагент КАК Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности
		|ИЗ
		|	Расчет КАК Расчет
		|ГДЕ
		|	Расчет.УступленнаяЗадолженность > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчет.Период,
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ссылка,
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	Расчет.Период,
		|	Расчет.СтатьяБюджета,
		|	СУММА(Расчет.СуммаПоступления),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход),
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности
		|ИЗ
		|	Расчет КАК Расчет
		|ГДЕ
		|	Расчет.СуммаПоступления > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчет.Период,
		|	Расчет.СтатьяБюджета,
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ссылка,
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	Расчет.Период,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
		|	СУММА(Расчет.Комиссия),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности
		|ИЗ
		|	Расчет КАК Расчет
		|ГДЕ
		|	Расчет.Комиссия > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчет.Период,
		|	Расчет.Организация,
		|	Расчет.Контрагент,
		|	Расчет.ЭлементСтруктурыЗадолженности";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// регистр РасчетыСКонтрагентамиГрафики
	Движения.РасчетыСКонтрагентамиГрафики.Записывать = Истина;
	Движения.РасчетыСКонтрагентамиГрафики.Загрузить(РезультатыЗапроса[2].Выгрузить());

	// регистр ВерсииРасчетов
	Движения.ВерсииРасчетов.Записывать = Истина;
	Движение = Движения.ВерсииРасчетов.Добавить();
	Движение.Период = Дата;
	Движение.ВерсияГрафика = Ссылка;
	Движение.ПредметГрафика = Ссылка;
	Движение.Организация = Организация;
	
	// регистр ЭффективностьФакторинга
	Движения.ЭффективностьФакторинга.Записывать = Истина;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ЭффективностьФакторинга.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
